 [
  {
  "id": 1,
  "title": "New Screencast Series - Feature Focus",
  "author": "Carlos Souza",
  "postDate": "08-08-2014",
  "body": "<div class='post-body'><p>Yesterday we announced Code School's new Feature Focus screencast series.</p><p>In this series, we pick a popular web-based product and explore a few of its key features. We do this by building our own version of these features in their most simple form.&nbsp;</p><p><img alt='image' src='http://media.tumblr.com/08829a3bfae5bb1acd3b89b440863250/tumblr_inline_n9n3v4EQWE1ru08zr.png'></p><p>As a viewer, if you ever need to implement a similar feature in your own projects, you can watch the Feature Focus series to find reference code and feature suggestions. But wait,&nbsp;<strong>THERE'S MORE!</strong></p><p><strong><img alt='image' src='http://media.tumblr.com/546ab45db25121108f163d718129acc8/tumblr_inline_n9mzb4p6xb1ru08zr.jpg'></strong></p><p>Each 20-minute episode is split into two parts that cover a single feature. First, we go over our version of the feature by briefly looking at the code and discussing our design decisions.&nbsp;In the second part, we meet with a developer from the original product team and show them our code.</p><p>While meeting with the product team, they give feedback as we contrast our simple version with their fully developed version. This leads to interesting conversation about how each team arrived at their current product version and what technical challenges were faced along the way.</p><h2 id='basecamp'>Basecamp</h2><p>The first product we focus on is <a href='https://basecamp.com/' title='Basecamp' target='_blank'>Basecamp</a>, one of the leading project management apps. In our feature review of Basecamp, we chose to implement search, message notification, timeline, and infinite scrolling. We then flew to Chicago to meet with&nbsp;David Heinemeier Hansson, founder and CTO at Basecamp, and the creator of <a href='https://www.codeschool.com/paths/ruby' title='Ruby Path on Code School' target='_blank'>Ruby on Rails</a>, to get his feedback on our version of code.</p><p><img alt='image' src='http://media.tumblr.com/172e5c83a5ede16a7be3b82201ba4349/tumblr_inline_n9n3jdJjSu1ru08zr.png'></p><p>The first Feature Focus screencast is <a href='https://www.codeschool.com/screencasts/basecamp-search' title='Feature Focus - Basecamp' target='_blank'><strong>available for free</strong></a>,&nbsp;and the source code is up on&nbsp;<a href='https://github.com/codeschool/featurefocus/tree/basecamp' title='Feature Focus Basecamp' target='_blank'>GitHub</a>.<strong><br></strong></p><p><span>Be sure to join our discussion in the&nbsp;</span><a href='http://discuss.codeschool.io/' title='Code School Discussion Forum' target='_blank'>Code School Forum</a><span>&nbsp;and let us know what you think.&nbsp;We hope you enjoy watching this series as much as we've enjoyed producing it!</span></p></div>"
  },
  {
  "id": 2,
  "title": "Code School’s New Course Engine",
  "author": "Adam Rensel",
  "postDate": "07-31-2014",
  "body": "<div class='post-body'><p>The Code School team is made up of many innovators, so things never stay the same for long. We spend a ton of time creating courses and updating the technology behind courses. Our newest update is a course player engine that is changing the way we create courses and the way you play them.&nbsp;</p><p>In the olden days, all Code School courses were created as self-contained Rails apps that communicate with the main codeschool.com site to track things like progress and points. This worked great for awhile, since it allowed us to add features and innovate on each course. Fast forward to 2014, and we were feeling the pain of maintaining and updating thirty or so slightly different apps. This mounting pressure prompted us to start developing a new course engine that would tackle these issues.</p><p><img alt='image' src='http://i.imgur.com/KFBJBEi.png' width='500'></p><p>Our new course engine is a single app that is capable of playing course content stored in version controlled text files (they look a little like markdown). This engine was built from the ground up and designed to share templates and features across all courses. Now, if we need to retrofit a new video player we don’t have to change and deploy thirty apps, we can change it once and it’s done.</p><p>The templating system uses AngularJS directives to simplify our complex interfaces. For example, when a designer wants to change the position of the instructions in a challenge, they can simply move an <code>&lt;instructions&gt;&lt;/instructions&gt;</code> tag instead of needing a dev to change more complex code. The same can be said for <code>&lt;code-editor&gt;&lt;/code-editor&gt;</code> and the ever-popular&nbsp;<code>&lt;challenge-tasks&gt;&lt;/challenge-tasks&gt;</code> UI element that’s used in the Shaping up with Angular.js course.</p><p>We’re also using this new course engine to create new tools for course production. These tools will help make the production process faster and more efficient, so we can get more content out each year. This also allows our designers and front-end team to work on other cool things, such as improving the user experience on our site and designing/building the next generation of challenge interfaces. We’ve also begun working on a course builder so our instructors can build courses as they write content, which should decrease the amount of edits and tweaks that slow down that process.</p><p>You might be wondering, if all new courses share the same interface elements, what happens to that innovation Code School loves? This new course engine&nbsp;gives our developers more time to innovate as we wait for content to be finalized. That being said, we’ve got&nbsp;some really awesome things in the pipeline for new courses that we can’t wait for you to see!</p><p>To play our courses that are already using the new course engine, check out <a href='https://www.codeschool.com/courses/shaping-up-with-angular-js' target='_blank'>Shaping up with Angular.js</a>, <a href='https://www.codeschool.com/courses/discover-drive' target='_blank'>Discover Drive</a>, and <a href='https://www.codeschool.com/courses/javascript-best-practices' target='_blank'>JavaScript Best Practices</a>. If you have suggestions for new Code School features, you can submit your ideas <a href='https://codeschool.uservoice.com/forums/217988-feature-suggestions?__utma=1.1353040805.1393511049.1406756900.1406817492.9&amp;__utmb=1.11.10.1406817492&amp;__utmc=1&amp;__utmk=107036290&amp;__utmv=-&amp;__utmx=-&amp;__utmz=1.1405976119.1.1.utmcsr%3D%28direct%29%7Cutmccn%3D%28direct%29%7Cutmcmd%3D%28none%29' target='_blank'>here</a>. We’re always looking for new ways to improve your educational experience.</p></div>"
  }
]